Revit 2027 API
ElectricalSystem.Create(Document, IList<ElementId>, ElectricalSystemType) Method
 Creates a new MEP Electrical System element from a set of electrical components.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElectricalSystem Create(
	Document document,
	IList<ElementId> electComponents,
	ElectricalSystemType elecSysType
)
Public Shared Function Create (
	document As Document,
	electComponents As IList(Of ElementId),
	elecSysType As ElectricalSystemType
) As ElectricalSystem
public:
static ElectricalSystem^ Create(
	Document^ document,
	IList<ElementId^>^ electComponents,
	ElectricalSystemType elecSysType
)
static member Create :
        document : Document *
        electComponents : IList<ElementId> *
        elecSysType : ElectricalSystemType -> ElectricalSystem
Parameters
document Document
 The Document.
electComponents IList<ElementId>
 The electrical components in this system.
elecSysType ElectricalSystemType
 The System Type of electrical system.
Return Value
ElectricalSystem
 If successful a new MEP Electrical System element within the project, otherwise null.
Exceptions
Exception | Condition
ArgumentException |  There should be at least one component that can create the specified circuit type
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ElectricalSystem Class
Create Overload
Autodesk.Revit.DB.Electrical Namespace